test/fixtures/vcr_cassettes/countryinfoservice.json

[
  {
    "request": {
      "body": "<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\"><soap:Body><CountryISOCode xmlns=\"http://www.oorsprong.org/websamples.countryinfo\"><sCountryName>Netherlands</sCountryName></CountryISOCode></soap:Body></soap:Envelope>",
      "headers": {
        "Content-Type": "text/xml; encoding=utf-8",
        "SOAPAction": ""
      },
      "method": "post",
      "options": [],
      "request_body": "",
      "url": "http://webservices.oorsprong.org/websamples.countryinfo/CountryInfoService.wso"
    },
    "response": {
      "binary": false,
      "body": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\r\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n  <soap:Body>\r\n    <m:CountryISOCodeResponse xmlns:m=\"http://www.oorsprong.org/websamples.countryinfo\">\r\n      <m:CountryISOCodeResult>NL</m:CountryISOCodeResult>\r\n    </m:CountryISOCodeResponse>\r\n  </soap:Body>\r\n</soap:Envelope>",
      "headers": {
        "Cache-Control": "private, max-age=0",
        "Content-Type": "text/xml; charset=utf-8",
        "Server": "Microsoft-IIS/8.5",
        "Web-Service": "DataFlex 18.2",
        "Date": "Wed, 25 Apr 2018 06:20:09 GMT",
        "Content-Length": "341"
      },
      "status_code": 200,
      "type": "ok"
    }
  }
]